xfire-core/src/test/org/codehaus/xfire/addressing/testcases/echo/soap12/message8.xml

<?xml version='1.0' ?>
<!-- $Id$ -->
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope"
 xmlns:wsa="http://www.w3.org/2005/08/addressing">
 <env:Header>
  <wsa:Action>http://example.org/action/echoIn</wsa:Action>
  <wsa:To>http://www.w3.org/2005/08/addressing/anonymous</wsa:To> 
  <wsa:MessageID>urn:uuid:10830A4B-FF2F-4101-8834-42651E56A0BD</wsa:MessageID>
  <wsa:ReplyTo>
   <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
   <wsa:ReferenceParameters xmlns:customer="http://example.org/customer">
    <customer:CustomerKey>Key#123456789</customer:CustomerKey>
   </wsa:ReferenceParameters>
  </wsa:ReplyTo>
  <wsa:FaultTo>
   <wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
   <wsa:ReferenceParameters xmlns:customer="http://example.org/customer">
    <customer:CustomerKey>Fault#123456789</customer:CustomerKey>
   </wsa:ReferenceParameters>
  </wsa:FaultTo>
 </env:Header>
 <env:Body>
  <m:echo xmlns:m="http://example.org/echo"/>
 </env:Body>
</env:Envelope>
